tests/k6/resultado-carga-100.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /home/celso/es-terraplenagem/tests/k6/carga.js
        output: -

     scenarios: (100.00%) 1 scenario, 100 max VUs, 3m0s max duration (incl. graceful stop):
              * default: Up to 100 looping VUs for 2m30s over 4 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m00.9s), 001/100 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 001/100 VUs  0m00.9s/2m30.0s

running (0m01.9s), 002/100 VUs, 1 complete and 0 interrupted iterations
default   [   1% ] 002/100 VUs  0m01.9s/2m30.0s

running (0m02.9s), 003/100 VUs, 3 complete and 0 interrupted iterations
default   [   2% ] 003/100 VUs  0m02.9s/2m30.0s

running (0m03.9s), 004/100 VUs, 6 complete and 0 interrupted iterations
default   [   3% ] 004/100 VUs  0m03.9s/2m30.0s

running (0m04.9s), 005/100 VUs, 10 complete and 0 interrupted iterations
default   [   3% ] 005/100 VUs  0m04.9s/2m30.0s

running (0m05.9s), 006/100 VUs, 15 complete and 0 interrupted iterations
default   [   4% ] 006/100 VUs  0m05.9s/2m30.0s

running (0m06.9s), 007/100 VUs, 21 complete and 0 interrupted iterations
default   [   5% ] 007/100 VUs  0m06.9s/2m30.0s

running (0m07.9s), 008/100 VUs, 28 complete and 0 interrupted iterations
default   [   5% ] 008/100 VUs  0m07.9s/2m30.0s

running (0m08.9s), 009/100 VUs, 36 complete and 0 interrupted iterations
default   [   6% ] 009/100 VUs  0m08.9s/2m30.0s

running (0m09.9s), 010/100 VUs, 45 complete and 0 interrupted iterations
default   [   7% ] 010/100 VUs  0m09.9s/2m30.0s

running (0m10.9s), 011/100 VUs, 55 complete and 0 interrupted iterations
default   [   7% ] 011/100 VUs  0m10.9s/2m30.0s

running (0m11.9s), 012/100 VUs, 66 complete and 0 interrupted iterations
default   [   8% ] 012/100 VUs  0m11.9s/2m30.0s

running (0m12.9s), 013/100 VUs, 78 complete and 0 interrupted iterations
default   [   9% ] 013/100 VUs  0m12.9s/2m30.0s

running (0m13.9s), 014/100 VUs, 91 complete and 0 interrupted iterations
default   [   9% ] 014/100 VUs  0m13.9s/2m30.0s

running (0m14.9s), 015/100 VUs, 105 complete and 0 interrupted iterations
default   [  10% ] 015/100 VUs  0m14.9s/2m30.0s

running (0m15.9s), 016/100 VUs, 120 complete and 0 interrupted iterations
default   [  11% ] 016/100 VUs  0m15.9s/2m30.0s

running (0m16.9s), 017/100 VUs, 136 complete and 0 interrupted iterations
default   [  11% ] 017/100 VUs  0m16.9s/2m30.0s

running (0m17.9s), 018/100 VUs, 153 complete and 0 interrupted iterations
default   [  12% ] 018/100 VUs  0m17.9s/2m30.0s

running (0m18.9s), 019/100 VUs, 171 complete and 0 interrupted iterations
default   [  13% ] 019/100 VUs  0m18.9s/2m30.0s

running (0m19.9s), 020/100 VUs, 190 complete and 0 interrupted iterations
default   [  13% ] 020/100 VUs  0m19.9s/2m30.0s

running (0m20.9s), 021/100 VUs, 204 complete and 0 interrupted iterations
default   [  14% ] 021/100 VUs  0m20.9s/2m30.0s

running (0m21.9s), 022/100 VUs, 223 complete and 0 interrupted iterations
default   [  15% ] 022/100 VUs  0m21.9s/2m30.0s

running (0m22.9s), 023/100 VUs, 242 complete and 0 interrupted iterations
default   [  15% ] 023/100 VUs  0m22.9s/2m30.0s

running (0m23.9s), 024/100 VUs, 264 complete and 0 interrupted iterations
default   [  16% ] 024/100 VUs  0m23.9s/2m30.0s

running (0m24.9s), 025/100 VUs, 284 complete and 0 interrupted iterations
default   [  17% ] 025/100 VUs  0m24.9s/2m30.0s

running (0m25.9s), 026/100 VUs, 304 complete and 0 interrupted iterations
default   [  17% ] 026/100 VUs  0m25.9s/2m30.0s

running (0m26.9s), 027/100 VUs, 330 complete and 0 interrupted iterations
default   [  18% ] 027/100 VUs  0m26.9s/2m30.0s

running (0m27.9s), 028/100 VUs, 351 complete and 0 interrupted iterations
default   [  19% ] 028/100 VUs  0m27.9s/2m30.0s

running (0m28.9s), 028/100 VUs, 378 complete and 0 interrupted iterations
default   [  19% ] 028/100 VUs  0m28.9s/2m30.0s

running (0m29.9s), 029/100 VUs, 406 complete and 0 interrupted iterations
default   [  20% ] 029/100 VUs  0m29.9s/2m30.0s

running (0m30.9s), 032/100 VUs, 435 complete and 0 interrupted iterations
default   [  21% ] 032/100 VUs  0m30.9s/2m30.0s

running (0m31.9s), 034/100 VUs, 467 complete and 0 interrupted iterations
default   [  21% ] 034/100 VUs  0m31.9s/2m30.0s

running (0m32.9s), 036/100 VUs, 498 complete and 0 interrupted iterations
default   [  22% ] 036/100 VUs  0m32.9s/2m30.0s

running (0m33.9s), 039/100 VUs, 531 complete and 0 interrupted iterations
default   [  23% ] 039/100 VUs  0m33.9s/2m30.0s

running (0m34.9s), 041/100 VUs, 568 complete and 0 interrupted iterations
default   [  23% ] 041/100 VUs  0m34.9s/2m30.0s

running (0m35.9s), 043/100 VUs, 597 complete and 0 interrupted iterations
default   [  24% ] 043/100 VUs  0m35.9s/2m30.0s

running (0m36.9s), 046/100 VUs, 640 complete and 0 interrupted iterations
default   [  25% ] 046/100 VUs  0m36.9s/2m30.0s

running (0m37.9s), 048/100 VUs, 684 complete and 0 interrupted iterations
default   [  25% ] 048/100 VUs  0m37.9s/2m30.0s

running (0m38.9s), 050/100 VUs, 732 complete and 0 interrupted iterations
default   [  26% ] 050/100 VUs  0m38.9s/2m30.0s

running (0m39.9s), 053/100 VUs, 780 complete and 0 interrupted iterations
default   [  27% ] 053/100 VUs  0m39.9s/2m30.0s

running (0m40.9s), 055/100 VUs, 833 complete and 0 interrupted iterations
default   [  27% ] 055/100 VUs  0m40.9s/2m30.0s

running (0m41.9s), 057/100 VUs, 888 complete and 0 interrupted iterations
default   [  28% ] 057/100 VUs  0m41.9s/2m30.0s

running (0m42.9s), 060/100 VUs, 941 complete and 0 interrupted iterations
default   [  29% ] 060/100 VUs  0m42.9s/2m30.0s

running (0m43.9s), 062/100 VUs, 996 complete and 0 interrupted iterations
default   [  29% ] 062/100 VUs  0m43.9s/2m30.0s

running (0m44.9s), 064/100 VUs, 1046 complete and 0 interrupted iterations
default   [  30% ] 064/100 VUs  0m44.9s/2m30.0s

running (0m46.0s), 067/100 VUs, 1110 complete and 0 interrupted iterations
default   [  31% ] 067/100 VUs  0m46.0s/2m30.0s

running (0m46.9s), 069/100 VUs, 1169 complete and 0 interrupted iterations
default   [  31% ] 069/100 VUs  0m46.9s/2m30.0s

running (0m47.9s), 071/100 VUs, 1237 complete and 0 interrupted iterations
default   [  32% ] 071/100 VUs  0m47.9s/2m30.0s

running (0m48.9s), 074/100 VUs, 1299 complete and 0 interrupted iterations
default   [  33% ] 074/100 VUs  0m48.9s/2m30.0s

running (0m49.9s), 076/100 VUs, 1366 complete and 0 interrupted iterations
default   [  33% ] 076/100 VUs  0m49.9s/2m30.0s

running (0m50.9s), 078/100 VUs, 1437 complete and 0 interrupted iterations
default   [  34% ] 078/100 VUs  0m50.9s/2m30.0s

running (0m51.9s), 081/100 VUs, 1512 complete and 0 interrupted iterations
default   [  35% ] 081/100 VUs  0m51.9s/2m30.0s

running (0m52.9s), 083/100 VUs, 1592 complete and 0 interrupted iterations
default   [  35% ] 083/100 VUs  0m52.9s/2m30.0s

running (0m53.9s), 085/100 VUs, 1671 complete and 0 interrupted iterations
default   [  36% ] 085/100 VUs  0m53.9s/2m30.0s

running (0m54.9s), 088/100 VUs, 1747 complete and 0 interrupted iterations
default   [  37% ] 088/100 VUs  0m54.9s/2m30.0s

running (0m55.9s), 090/100 VUs, 1832 complete and 0 interrupted iterations
default   [  37% ] 090/100 VUs  0m55.9s/2m30.0s

running (0m56.9s), 092/100 VUs, 1921 complete and 0 interrupted iterations
default   [  38% ] 092/100 VUs  0m56.9s/2m30.0s

running (0m57.9s), 095/100 VUs, 2001 complete and 0 interrupted iterations
default   [  39% ] 095/100 VUs  0m57.9s/2m30.0s

running (0m58.9s), 097/100 VUs, 2093 complete and 0 interrupted iterations
default   [  39% ] 097/100 VUs  0m58.9s/2m30.0s

running (0m59.9s), 099/100 VUs, 2179 complete and 0 interrupted iterations
default   [  40% ] 099/100 VUs  0m59.9s/2m30.0s

running (1m00.9s), 100/100 VUs, 2252 complete and 0 interrupted iterations
default   [  41% ] 100/100 VUs  1m00.9s/2m30.0s

running (1m01.9s), 100/100 VUs, 2309 complete and 0 interrupted iterations
default   [  41% ] 100/100 VUs  1m01.9s/2m30.0s

running (1m02.9s), 100/100 VUs, 2398 complete and 0 interrupted iterations
default   [  42% ] 100/100 VUs  1m02.9s/2m30.0s

running (1m04.0s), 100/100 VUs, 2487 complete and 0 interrupted iterations
default   [  43% ] 100/100 VUs  1m04.0s/2m30.0s

running (1m04.9s), 100/100 VUs, 2563 complete and 0 interrupted iterations
default   [  43% ] 100/100 VUs  1m04.9s/2m30.0s

running (1m05.9s), 100/100 VUs, 2626 complete and 0 interrupted iterations
default   [  44% ] 100/100 VUs  1m05.9s/2m30.0s

running (1m06.9s), 100/100 VUs, 2709 complete and 0 interrupted iterations
default   [  45% ] 100/100 VUs  1m06.9s/2m30.0s

running (1m07.9s), 100/100 VUs, 2808 complete and 0 interrupted iterations
default   [  45% ] 100/100 VUs  1m07.9s/2m30.0s

running (1m08.9s), 100/100 VUs, 2871 complete and 0 interrupted iterations
default   [  46% ] 100/100 VUs  1m08.9s/2m30.0s

running (1m09.9s), 100/100 VUs, 2968 complete and 0 interrupted iterations
default   [  47% ] 100/100 VUs  1m09.9s/2m30.0s

running (1m10.9s), 100/100 VUs, 3057 complete and 0 interrupted iterations
default   [  47% ] 100/100 VUs  1m10.9s/2m30.0s

running (1m11.9s), 100/100 VUs, 3138 complete and 0 interrupted iterations
default   [  48% ] 100/100 VUs  1m11.9s/2m30.0s

running (1m12.9s), 100/100 VUs, 3237 complete and 0 interrupted iterations
default   [  49% ] 100/100 VUs  1m12.9s/2m30.0s

running (1m13.9s), 100/100 VUs, 3315 complete and 0 interrupted iterations
default   [  49% ] 100/100 VUs  1m13.9s/2m30.0s

running (1m14.9s), 100/100 VUs, 3409 complete and 0 interrupted iterations
default   [  50% ] 100/100 VUs  1m14.9s/2m30.0s

running (1m15.9s), 100/100 VUs, 3502 complete and 0 interrupted iterations
default   [  51% ] 100/100 VUs  1m15.9s/2m30.0s

running (1m16.9s), 100/100 VUs, 3583 complete and 0 interrupted iterations
default   [  51% ] 100/100 VUs  1m16.9s/2m30.0s

running (1m17.9s), 100/100 VUs, 3681 complete and 0 interrupted iterations
default   [  52% ] 100/100 VUs  1m17.9s/2m30.0s

running (1m18.9s), 100/100 VUs, 3733 complete and 0 interrupted iterations
default   [  53% ] 100/100 VUs  1m18.9s/2m30.0s

running (1m19.9s), 100/100 VUs, 3831 complete and 0 interrupted iterations
default   [  53% ] 100/100 VUs  1m19.9s/2m30.0s

running (1m20.9s), 100/100 VUs, 3881 complete and 0 interrupted iterations
default   [  54% ] 100/100 VUs  1m20.9s/2m30.0s

running (1m21.9s), 100/100 VUs, 3979 complete and 0 interrupted iterations
default   [  55% ] 100/100 VUs  1m21.9s/2m30.0s

running (1m22.9s), 100/100 VUs, 4039 complete and 0 interrupted iterations
default   [  55% ] 100/100 VUs  1m22.9s/2m30.0s

running (1m24.0s), 100/100 VUs, 4128 complete and 0 interrupted iterations
default   [  56% ] 100/100 VUs  1m24.0s/2m30.0s

running (1m24.9s), 100/100 VUs, 4214 complete and 0 interrupted iterations
default   [  57% ] 100/100 VUs  1m24.9s/2m30.0s

running (1m25.9s), 100/100 VUs, 4274 complete and 0 interrupted iterations
default   [  57% ] 100/100 VUs  1m25.9s/2m30.0s

running (1m26.9s), 100/100 VUs, 4374 complete and 0 interrupted iterations
default   [  58% ] 100/100 VUs  1m26.9s/2m30.0s

running (1m27.9s), 100/100 VUs, 4441 complete and 0 interrupted iterations
default   [  59% ] 100/100 VUs  1m27.9s/2m30.0s

running (1m28.9s), 100/100 VUs, 4540 complete and 0 interrupted iterations
default   [  59% ] 100/100 VUs  1m28.9s/2m30.0s

running (1m29.9s), 100/100 VUs, 4625 complete and 0 interrupted iterations
default   [  60% ] 100/100 VUs  1m29.9s/2m30.0s

running (1m30.9s), 100/100 VUs, 4708 complete and 0 interrupted iterations
default   [  61% ] 100/100 VUs  1m30.9s/2m30.0s

running (1m31.9s), 100/100 VUs, 4802 complete and 0 interrupted iterations
default   [  61% ] 100/100 VUs  1m31.9s/2m30.0s

running (1m32.9s), 100/100 VUs, 4881 complete and 0 interrupted iterations
default   [  62% ] 100/100 VUs  1m32.9s/2m30.0s

running (1m33.9s), 100/100 VUs, 4942 complete and 0 interrupted iterations
default   [  63% ] 100/100 VUs  1m33.9s/2m30.0s

running (1m34.9s), 100/100 VUs, 5041 complete and 0 interrupted iterations
default   [  63% ] 100/100 VUs  1m34.9s/2m30.0s

running (1m35.9s), 100/100 VUs, 5114 complete and 0 interrupted iterations
default   [  64% ] 100/100 VUs  1m35.9s/2m30.0s

running (1m36.9s), 100/100 VUs, 5207 complete and 0 interrupted iterations
default   [  65% ] 100/100 VUs  1m36.9s/2m30.0s

running (1m37.9s), 100/100 VUs, 5300 complete and 0 interrupted iterations
default   [  65% ] 100/100 VUs  1m37.9s/2m30.0s

running (1m39.0s), 100/100 VUs, 5373 complete and 0 interrupted iterations
default   [  66% ] 100/100 VUs  1m39.0s/2m30.0s

running (1m39.9s), 100/100 VUs, 5468 complete and 0 interrupted iterations
default   [  67% ] 100/100 VUs  1m39.9s/2m30.0s

running (1m40.9s), 100/100 VUs, 5536 complete and 0 interrupted iterations
default   [  67% ] 100/100 VUs  1m40.9s/2m30.0s

running (1m41.9s), 100/100 VUs, 5631 complete and 0 interrupted iterations
default   [  68% ] 100/100 VUs  1m41.9s/2m30.0s

running (1m42.9s), 100/100 VUs, 5713 complete and 0 interrupted iterations
default   [  69% ] 100/100 VUs  1m42.9s/2m30.0s

running (1m43.9s), 100/100 VUs, 5792 complete and 0 interrupted iterations
default   [  69% ] 100/100 VUs  1m43.9s/2m30.0s

running (1m44.9s), 100/100 VUs, 5891 complete and 0 interrupted iterations
default   [  70% ] 100/100 VUs  1m44.9s/2m30.0s

running (1m45.9s), 100/100 VUs, 5974 complete and 0 interrupted iterations
default   [  71% ] 100/100 VUs  1m45.9s/2m30.0s

running (1m46.9s), 100/100 VUs, 6063 complete and 0 interrupted iterations
default   [  71% ] 100/100 VUs  1m46.9s/2m30.0s

running (1m47.9s), 100/100 VUs, 6162 complete and 0 interrupted iterations
default   [  72% ] 100/100 VUs  1m47.9s/2m30.0s

running (1m48.9s), 100/100 VUs, 6242 complete and 0 interrupted iterations
default   [  73% ] 100/100 VUs  1m48.9s/2m30.0s

running (1m49.9s), 100/100 VUs, 6336 complete and 0 interrupted iterations
default   [  73% ] 100/100 VUs  1m49.9s/2m30.0s

running (1m50.9s), 100/100 VUs, 6431 complete and 0 interrupted iterations
default   [  74% ] 100/100 VUs  1m50.9s/2m30.0s

running (1m51.9s), 100/100 VUs, 6507 complete and 0 interrupted iterations
default   [  75% ] 100/100 VUs  1m51.9s/2m30.0s

running (1m52.9s), 100/100 VUs, 6606 complete and 0 interrupted iterations
default   [  75% ] 100/100 VUs  1m52.9s/2m30.0s

running (1m53.9s), 100/100 VUs, 6689 complete and 0 interrupted iterations
default   [  76% ] 100/100 VUs  1m53.9s/2m30.0s

running (1m54.9s), 100/100 VUs, 6783 complete and 0 interrupted iterations
default   [  77% ] 100/100 VUs  1m54.9s/2m30.0s

running (1m55.9s), 100/100 VUs, 6881 complete and 0 interrupted iterations
default   [  77% ] 100/100 VUs  1m55.9s/2m30.0s

running (1m56.9s), 100/100 VUs, 6964 complete and 0 interrupted iterations
default   [  78% ] 100/100 VUs  1m56.9s/2m30.0s

running (1m58.0s), 100/100 VUs, 7060 complete and 0 interrupted iterations
default   [  79% ] 100/100 VUs  1m58.0s/2m30.0s

running (1m58.9s), 100/100 VUs, 7155 complete and 0 interrupted iterations
default   [  79% ] 100/100 VUs  1m58.9s/2m30.0s

running (1m59.9s), 100/100 VUs, 7243 complete and 0 interrupted iterations
default   [  80% ] 100/100 VUs  1m59.9s/2m30.0s

running (2m00.9s), 099/100 VUs, 7337 complete and 0 interrupted iterations
default   [  81% ] 099/100 VUs  2m00.9s/2m30.0s

running (2m01.9s), 096/100 VUs, 7405 complete and 0 interrupted iterations
default   [  81% ] 096/100 VUs  2m01.9s/2m30.0s

running (2m02.9s), 094/100 VUs, 7451 complete and 0 interrupted iterations
default   [  82% ] 094/100 VUs  2m02.9s/2m30.0s

running (2m03.9s), 090/100 VUs, 7516 complete and 0 interrupted iterations
default   [  83% ] 090/100 VUs  2m03.9s/2m30.0s

running (2m04.9s), 086/100 VUs, 7601 complete and 0 interrupted iterations
default   [  83% ] 086/100 VUs  2m04.9s/2m30.0s

running (2m05.9s), 082/100 VUs, 7684 complete and 0 interrupted iterations
default   [  84% ] 082/100 VUs  2m05.9s/2m30.0s

running (2m06.9s), 080/100 VUs, 7763 complete and 0 interrupted iterations
default   [  85% ] 080/100 VUs  2m06.9s/2m30.0s

running (2m07.9s), 076/100 VUs, 7833 complete and 0 interrupted iterations
default   [  85% ] 076/100 VUs  2m07.9s/2m30.0s

running (2m08.9s), 073/100 VUs, 7908 complete and 0 interrupted iterations
default   [  86% ] 073/100 VUs  2m08.9s/2m30.0s

running (2m09.9s), 069/100 VUs, 7977 complete and 0 interrupted iterations
default   [  87% ] 069/100 VUs  2m09.9s/2m30.0s

running (2m10.9s), 066/100 VUs, 8044 complete and 0 interrupted iterations
default   [  87% ] 066/100 VUs  2m10.9s/2m30.0s

running (2m11.9s), 062/100 VUs, 8109 complete and 0 interrupted iterations
default   [  88% ] 062/100 VUs  2m11.9s/2m30.0s

running (2m12.9s), 059/100 VUs, 8162 complete and 0 interrupted iterations
default   [  89% ] 059/100 VUs  2m12.9s/2m30.0s

running (2m13.9s), 055/100 VUs, 8221 complete and 0 interrupted iterations
default   [  89% ] 055/100 VUs  2m13.9s/2m30.0s

running (2m14.9s), 052/100 VUs, 8276 complete and 0 interrupted iterations
default   [  90% ] 052/100 VUs  2m14.9s/2m30.0s

running (2m15.9s), 049/100 VUs, 8328 complete and 0 interrupted iterations
default   [  91% ] 049/100 VUs  2m15.9s/2m30.0s

running (2m16.9s), 046/100 VUs, 8377 complete and 0 interrupted iterations
default   [  91% ] 046/100 VUs  2m16.9s/2m30.0s

running (2m17.9s), 042/100 VUs, 8420 complete and 0 interrupted iterations
default   [  92% ] 042/100 VUs  2m17.9s/2m30.0s

running (2m18.9s), 038/100 VUs, 8462 complete and 0 interrupted iterations
default   [  93% ] 038/100 VUs  2m18.9s/2m30.0s

running (2m19.9s), 035/100 VUs, 8499 complete and 0 interrupted iterations
default   [  93% ] 035/100 VUs  2m19.9s/2m30.0s

running (2m20.9s), 033/100 VUs, 8533 complete and 0 interrupted iterations
default   [  94% ] 033/100 VUs  2m20.9s/2m30.0s

running (2m21.9s), 030/100 VUs, 8564 complete and 0 interrupted iterations
default   [  95% ] 030/100 VUs  2m21.9s/2m30.0s

running (2m22.9s), 026/100 VUs, 8594 complete and 0 interrupted iterations
default   [  95% ] 026/100 VUs  2m22.9s/2m30.0s

running (2m23.9s), 022/100 VUs, 8619 complete and 0 interrupted iterations
default   [  96% ] 022/100 VUs  2m23.9s/2m30.0s

running (2m24.9s), 018/100 VUs, 8641 complete and 0 interrupted iterations
default   [  97% ] 018/100 VUs  2m24.9s/2m30.0s

running (2m25.9s), 015/100 VUs, 8652 complete and 0 interrupted iterations
default   [  97% ] 015/100 VUs  2m25.9s/2m30.0s

running (2m26.9s), 012/100 VUs, 8667 complete and 0 interrupted iterations
default   [  98% ] 012/100 VUs  2m26.9s/2m30.0s

running (2m27.9s), 010/100 VUs, 8679 complete and 0 interrupted iterations
default   [  99% ] 010/100 VUs  2m27.9s/2m30.0s

running (2m28.9s), 007/100 VUs, 8689 complete and 0 interrupted iterations
default   [  99% ] 007/100 VUs  2m28.9s/2m30.0s

running (2m29.9s), 003/100 VUs, 8696 complete and 0 interrupted iterations
default   [ 100% ] 003/100 VUs  2m29.9s/2m30.0s


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<500' p(95)=96.14ms

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 43495   289.538003/s
    checks_succeeded...: 100.00% 43495 out of 43495
    checks_failed......: 0.00%   0 out of 43495

    ✓ /api/config OK
    ✓ /api/midias OK
    ✓ /api/blog?pagina=1&limite=9 OK
    ✓ /api/produtos OK
    ✓ /api/historia OK

    HTTP
    http_req_duration..............: avg=28.54ms min=2.27ms med=16.02ms max=305ms p(90)=68.46ms p(95)=96.14ms
      { expected_response:true }...: avg=28.54ms min=2.27ms med=16.02ms max=305ms p(90)=68.46ms p(95)=96.14ms
    http_req_failed................: 0.00%  0 out of 43495
    http_reqs......................: 43495  289.538003/s

    EXECUTION
    iteration_duration.............: avg=1.14s   min=1.01s  med=1.08s   max=1.93s p(90)=1.34s   p(95)=1.47s  
    iterations.....................: 8699   57.907601/s
    vus............................: 3      min=1          max=100
    vus_max........................: 100    min=100        max=100

    NETWORK
    data_received..................: 70 MB  466 kB/s
    data_sent......................: 3.7 MB 24 kB/s



running (2m30.2s), 000/100 VUs, 8699 complete and 0 interrupted iterations
default ✓ [ 100% ] 000/100 VUs  2m30s